distance = float(input("กรอกระยะทางที่เดินทาง : "))
member = str(input("คุณใช่สมาชิกหรือไม่ : ใช่พิมพ์ 'yes' ไม่ใช่พิมพ์ 'no' : "))
fare = 0

if member.lower() == "yes":
    if distance <= 5  :
        fare = 50*((100-10)/100)
        print("คุณคือสมาชิกได้รับส่วนลดค่าโดยสาร 10% มีค่าโดยสารเป็นจำนวนเงิน : " +str(fare)+" บาท")
    elif distance > 5 and distance <= 15:
        fare = 80*((100-10)/100)
        print("คุณคือสมาชิกได้รับส่วนลดค่าโดยสาร 10% มีค่าโดยสารเป็นจำนวนเงิน : " +str(fare)+" บาท")
    else:
        fare = 120*((100-10)/100)
        print("คุณคือสมาชิกได้รับส่วนลดค่าโดยสาร 10% มีค่าโดยสารเป็นจำนวนเงิน : " +str(fare)+" บาท")
elif member.lower() == "no":
    if distance <= 5  :
        print("คุณไม่ได้เป็นสมาชิกมีค่าโดยสาร : 50 บาท")
    elif distance > 5 and distance <= 15:
        print("คุณไม่ได้เป็นสมาชิกมีค่าโดยสาร : 80 บาท")
    else:
        print("คุณไม่ได้เป็นสมาชิกมีค่าโดยสาร : 120 บาท")
else:
    print("กรุณากรอกรายละเอียดให้ถุกต้อง!!!")

